#### SurfaceElementExtension Enumeration

---

|  |
| --- |
| See Also |

Presets for given Analytical Extension.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum SurfaceElementExtension ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration SurfaceElementExtension ``` |

| Visual C++ |
| --- |
| ``` public enum class SurfaceElementExtension ``` |

# Members

| Member name | Description |
| --- | --- |
| BottomOrTop | Bottom or Top of physical element. |
| Plane | Use a Plane for extension (e.g., Grid, Level). |

# See Also

Autodesk.Revit.DB.Structure Namespace